# Housing Market

### Introduction:

This time we will create our own dataset with fictional numbers to describe a house market. As we are going to create random data don't try to reason of the numbers.

### Step 1. Import the necessary libraries

In [1]:
import pandas as pd
import numpy as np

### Step 2. Create 3 differents Series, each of length 100, as follows: 
1. The first a random number from 1 to 4 
2. The second a random number from 1 to 3
3. The third a random number from 10,000 to 30,000

In [2]:
np.random.randint(1, high=5, size = 100)

array([3, 4, 4, 4, 1, 1, 3, 2, 1, 4, 2, 1, 1, 4, 2, 2, 1, 3, 3, 4, 2, 2,
       2, 1, 4, 1, 4, 2, 2, 3, 3, 3, 4, 4, 4, 4, 4, 4, 1, 2, 4, 1, 1, 4,
       1, 4, 4, 2, 4, 2, 2, 4, 3, 1, 4, 2, 1, 3, 4, 3, 2, 1, 1, 3, 2, 1,
       1, 2, 2, 1, 2, 1, 1, 4, 3, 3, 4, 3, 4, 2, 3, 2, 3, 2, 1, 3, 2, 2,
       2, 4, 3, 1, 4, 2, 1, 3, 4, 1, 3, 4])

In [3]:
no_1 = pd.Series(np.random.randint(1, high=5, size = 100, dtype='l'))
no_2 = pd.Series(np.random.randint(1, high=4, size = 100, dtype='l'))
no_3 = pd.Series(np.random.randint(10000, high=30001, size = 100, dtype='l'))

In [5]:
no_1[0:10]

0    3
1    1
2    4
3    3
4    1
5    1
6    1
7    2
8    4
9    2
dtype: int64

### Step 3. Let's create a DataFrame by joinning the Series by column

- concat은 2개 이상, 3개 이상도 concat 가능

In [6]:
joinning_series = pd.concat([no_1, no_2, no_3], axis = 1)
joinning_series.head()

   0  1      2
0  3  1  11696
1  1  1  29934
2  4  2  19535
3  3  1  22989
4  1  3  28147

### Step 4. Change the name of the columns to bedrs, bathrs, price_sqr_meter

In [7]:
joinning_series.rename(columns = {0 : 'bedrs' , 1 : 'bathrs', 2 : 'price_sqr_meter'}, inplace=True)
joinning_series.head()

   bedrs  bathrs  price_sqr_meter
0      3       1            11696
1      1       1            29934
2      4       2            19535
3      3       1            22989
4      1       3            28147

### Step 5. Create a one column DataFrame with the values of the 3 Series and assign it to 'bigcolumn'

In [8]:
bigcolumn = pd.concat([no_1, no_2, no_3], axis = 0)

In [9]:
bigcolumn

0         3
1         1
2         4
3         3
4         1
5         1
6         1
7         2
8         4
9         2
10        3
11        3
12        1
13        4
14        4
15        1
16        2
17        3
18        1
19        1
20        1
21        4
22        2
23        3
24        2
25        2
26        4
27        1
28        2
29        1
      ...
70    20839
71    29804
72    25181
73    20834
74    29883
75    15765
76    19302
77    29852
78    16970
79    21850
80    29524
81    26062
82    28078
83    15927
84    10438
85    18951
86    20529
87    17480
88    18799
89    21155
90    20154
91    10250
92    27914
93    10085
94    16246
95    13236
96    14068
97    27520
98    27245
99    24334
Length: 300, dtype: int64

### using to_frame when series to frame

In [10]:
bigcolumn = bigcolumn.to_frame()

In [11]:
bigcolumn.head()

   0
0  3
1  1
2  4
3  3
4  1

series to frame
- 말 그대로 시리즈를 데이터프레임으로 변환
- https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.Series.to_frame.html

### Step 6. Ops it seems it is going only until index 99. Is it true?

In [12]:
bigcolumn.index

Int64Index([ 0,  1,  2,  3,  4,  5,  6,  7,  8,  9,
            ...
            90, 91, 92, 93, 94, 95, 96, 97, 98, 99],
           dtype='int64', length=300)

In [13]:
len(bigcolumn)

300

### Step 7. Reindex the DataFrame so it goes from 0 to 299

In [14]:
bigcolumn.reset_index(drop=True, inplace=True)

In [15]:
bigcolumn.index

RangeIndex(start=0, stop=300, step=1)

In [16]:
bigcolumn

         0
0        3
1        1
2        4
3        3
4        1
5        1
6        1
7        2
8        4
9        2
10       3
11       3
12       1
13       4
14       4
15       1
16       2
17       3
18       1
19       1
20       1
21       4
22       2
23       3
24       2
25       2
26       4
27       1
28       2
29       1
..     ...
270  20839
271  29804
272  25181
273  20834
274  29883
275  15765
276  19302
277  29852
278  16970
279  21850
280  29524
281  26062
282  28078
283  15927
284  10438
285  18951
286  20529
287  17480
288  18799
289  21155
290  20154
291  10250
292  27914
293  10085
294  16246
295  13236
296  14068
297  27520
298  27245
299  24334

[300 rows x 1 columns]